name: "cifar10_googlenet"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    mean_file: "/home/tim/datasets/cifar10/mean.binaryproto"
  }
  data_param {
    source: "/home/tim/datasets/cifar10/train_lmdb"
    batch_size: 32
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    mean_file: "/home/tim/datasets/cifar10/mean.binaryproto"
  }
  data_param {
    source: "/home/tim/datasets/cifar10/test_lmdb"
    batch_size: 50
    backend: LMDB
  }
}
layer {
  name: "conv1_7x7_2s"
  type: "Convolution"
  bottom: "data"
  top: "conv1_7x7_2s"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv1_7x7_2s_relu"
  type: "ReLU"
  bottom: "conv1_7x7_2s"
  top: "conv1_7x7_2s"
}
layer {
  name: "conv1_norm1"
  type: "LRN"
  bottom: "conv1_7x7_2s"
  top: "conv1_norm1"
  lrn_param {
    local_size: 5
    alpha: 9.999999747378752e-05
    beta: 0.75
  }
}
layer {
  name: "conv2_1x1_1v"
  type: "Convolution"
  bottom: "conv1_norm1"
  top: "conv2_1x1_1v"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv2_1x1_1v_relu"
  type: "ReLU"
  bottom: "conv2_1x1_1v"
  top: "conv2_1x1_1v"
}
layer {
  name: "conv2_3x3_1s"
  type: "Convolution"
  bottom: "conv2_1x1_1v"
  top: "conv2_3x3_1s"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv2_3x3_1s_relu"
  type: "ReLU"
  bottom: "conv2_3x3_1s"
  top: "conv2_3x3_1s"
}
layer {
  name: "conv2_norm2"
  type: "LRN"
  bottom: "conv2_3x3_1s"
  top: "conv2_norm2"
  lrn_param {
    local_size: 5
    alpha: 9.999999747378752e-05
    beta: 0.75
  }
}
layer {
  name: "inception3a_conv1x1"
  type: "Convolution"
  bottom: "conv2_norm2"
  top: "Convolution1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception3a_conv1x1_relu"
  type: "ReLU"
  bottom: "Convolution1"
  top: "Convolution1"
}
layer {
  name: "inception3a_conv3x3_reduce"
  type: "Convolution"
  bottom: "conv2_norm2"
  top: "Convolution2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception3a_conv3x3_reduce_relu"
  type: "ReLU"
  bottom: "Convolution2"
  top: "Convolution2"
}
layer {
  name: "inception3a_"
  type: "Convolution"
  bottom: "Convolution2"
  top: "Convolution3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception3a_conv3x3"
  type: "ReLU"
  bottom: "Convolution3"
  top: "Convolution3"
}
layer {
  name: "inception3a_conv5x5_reduce"
  type: "Convolution"
  bottom: "conv2_norm2"
  top: "Convolution4"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception3a_conv5x5_reduce_relu"
  type: "ReLU"
  bottom: "Convolution4"
  top: "Convolution4"
}
layer {
  name: "inception3a_conv5x5"
  type: "Convolution"
  bottom: "Convolution4"
  top: "Convolution5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception3a_conv5x5_relu"
  type: "ReLU"
  bottom: "Convolution5"
  top: "Convolution5"
}
layer {
  name: "inception3a_maxpool3x3"
  type: "Pooling"
  bottom: "conv2_norm2"
  top: "Pooling1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception3a_maxpool3x3_proj1x1"
  type: "Convolution"
  bottom: "Pooling1"
  top: "Convolution6"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception3a_maxpool3x3_proj1x1_relu"
  type: "ReLU"
  bottom: "Convolution6"
  top: "Convolution6"
}
layer {
  name: "inception3a_output"
  type: "Concat"
  bottom: "Convolution1"
  bottom: "Convolution3"
  bottom: "Convolution5"
  bottom: "Convolution6"
  top: "Concat1"
}
layer {
  name: "inception3b_conv1x1"
  type: "Convolution"
  bottom: "Concat1"
  top: "Convolution7"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception3b_conv1x1_relu"
  type: "ReLU"
  bottom: "Convolution7"
  top: "Convolution7"
}
layer {
  name: "inception3b_conv3x3_reduce"
  type: "Convolution"
  bottom: "Concat1"
  top: "Convolution8"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception3b_conv3x3_reduce_relu"
  type: "ReLU"
  bottom: "Convolution8"
  top: "Convolution8"
}
layer {
  name: "inception3b_"
  type: "Convolution"
  bottom: "Convolution8"
  top: "Convolution9"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception3b_conv3x3"
  type: "ReLU"
  bottom: "Convolution9"
  top: "Convolution9"
}
layer {
  name: "inception3b_conv5x5_reduce"
  type: "Convolution"
  bottom: "Concat1"
  top: "Convolution10"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception3b_conv5x5_reduce_relu"
  type: "ReLU"
  bottom: "Convolution10"
  top: "Convolution10"
}
layer {
  name: "inception3b_conv5x5"
  type: "Convolution"
  bottom: "Convolution10"
  top: "Convolution11"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 96
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception3b_conv5x5_relu"
  type: "ReLU"
  bottom: "Convolution11"
  top: "Convolution11"
}
layer {
  name: "inception3b_maxpool3x3"
  type: "Pooling"
  bottom: "Concat1"
  top: "Pooling2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception3b_maxpool3x3_proj1x1"
  type: "Convolution"
  bottom: "Pooling2"
  top: "Convolution12"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception3b_maxpool3x3_proj1x1_relu"
  type: "ReLU"
  bottom: "Convolution12"
  top: "Convolution12"
}
layer {
  name: "inception3b_output"
  type: "Concat"
  bottom: "Convolution7"
  bottom: "Convolution9"
  bottom: "Convolution11"
  bottom: "Convolution12"
  top: "Concat2"
}
layer {
  name: "inception3_maxpool"
  type: "Pooling"
  bottom: "Concat2"
  top: "inception3_maxpool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception4a_conv1x1"
  type: "Convolution"
  bottom: "inception3_maxpool"
  top: "Convolution13"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 192
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4a_conv1x1_relu"
  type: "ReLU"
  bottom: "Convolution13"
  top: "Convolution13"
}
layer {
  name: "inception4a_conv3x3_reduce"
  type: "Convolution"
  bottom: "inception3_maxpool"
  top: "Convolution14"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4a_conv3x3_reduce_relu"
  type: "ReLU"
  bottom: "Convolution14"
  top: "Convolution14"
}
layer {
  name: "inception4a_"
  type: "Convolution"
  bottom: "Convolution14"
  top: "Convolution15"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 208
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4a_conv3x3"
  type: "ReLU"
  bottom: "Convolution15"
  top: "Convolution15"
}
layer {
  name: "inception4a_conv5x5_reduce"
  type: "Convolution"
  bottom: "inception3_maxpool"
  top: "Convolution16"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4a_conv5x5_reduce_relu"
  type: "ReLU"
  bottom: "Convolution16"
  top: "Convolution16"
}
layer {
  name: "inception4a_conv5x5"
  type: "Convolution"
  bottom: "Convolution16"
  top: "Convolution17"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 48
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4a_conv5x5_relu"
  type: "ReLU"
  bottom: "Convolution17"
  top: "Convolution17"
}
layer {
  name: "inception4a_maxpool3x3"
  type: "Pooling"
  bottom: "inception3_maxpool"
  top: "Pooling3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception4a_maxpool3x3_proj1x1"
  type: "Convolution"
  bottom: "Pooling3"
  top: "Convolution18"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4a_maxpool3x3_proj1x1_relu"
  type: "ReLU"
  bottom: "Convolution18"
  top: "Convolution18"
}
layer {
  name: "inception4a_output"
  type: "Concat"
  bottom: "Convolution13"
  bottom: "Convolution15"
  bottom: "Convolution17"
  bottom: "Convolution18"
  top: "Concat3"
}
layer {
  name: "inception4b_conv1x1"
  type: "Convolution"
  bottom: "Concat3"
  top: "Convolution19"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4b_conv1x1_relu"
  type: "ReLU"
  bottom: "Convolution19"
  top: "Convolution19"
}
layer {
  name: "inception4b_conv3x3_reduce"
  type: "Convolution"
  bottom: "Concat3"
  top: "Convolution20"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 112
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4b_conv3x3_reduce_relu"
  type: "ReLU"
  bottom: "Convolution20"
  top: "Convolution20"
}
layer {
  name: "inception4b_"
  type: "Convolution"
  bottom: "Convolution20"
  top: "Convolution21"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 224
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4b_conv3x3"
  type: "ReLU"
  bottom: "Convolution21"
  top: "Convolution21"
}
layer {
  name: "inception4b_conv5x5_reduce"
  type: "Convolution"
  bottom: "Concat3"
  top: "Convolution22"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 24
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4b_conv5x5_reduce_relu"
  type: "ReLU"
  bottom: "Convolution22"
  top: "Convolution22"
}
layer {
  name: "inception4b_conv5x5"
  type: "Convolution"
  bottom: "Convolution22"
  top: "Convolution23"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4b_conv5x5_relu"
  type: "ReLU"
  bottom: "Convolution23"
  top: "Convolution23"
}
layer {
  name: "inception4b_maxpool3x3"
  type: "Pooling"
  bottom: "Concat3"
  top: "Pooling4"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception4b_maxpool3x3_proj1x1"
  type: "Convolution"
  bottom: "Pooling4"
  top: "Convolution24"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4b_maxpool3x3_proj1x1_relu"
  type: "ReLU"
  bottom: "Convolution24"
  top: "Convolution24"
}
layer {
  name: "inception4b_output"
  type: "Concat"
  bottom: "Convolution19"
  bottom: "Convolution21"
  bottom: "Convolution23"
  bottom: "Convolution24"
  top: "Concat4"
}
layer {
  name: "inception4c_conv1x1"
  type: "Convolution"
  bottom: "Concat4"
  top: "Convolution25"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4c_conv1x1_relu"
  type: "ReLU"
  bottom: "Convolution25"
  top: "Convolution25"
}
layer {
  name: "inception4c_conv3x3_reduce"
  type: "Convolution"
  bottom: "Concat4"
  top: "Convolution26"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4c_conv3x3_reduce_relu"
  type: "ReLU"
  bottom: "Convolution26"
  top: "Convolution26"
}
layer {
  name: "inception4c_"
  type: "Convolution"
  bottom: "Convolution26"
  top: "Convolution27"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4c_conv3x3"
  type: "ReLU"
  bottom: "Convolution27"
  top: "Convolution27"
}
layer {
  name: "inception4c_conv5x5_reduce"
  type: "Convolution"
  bottom: "Concat4"
  top: "Convolution28"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 24
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4c_conv5x5_reduce_relu"
  type: "ReLU"
  bottom: "Convolution28"
  top: "Convolution28"
}
layer {
  name: "inception4c_conv5x5"
  type: "Convolution"
  bottom: "Convolution28"
  top: "Convolution29"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4c_conv5x5_relu"
  type: "ReLU"
  bottom: "Convolution29"
  top: "Convolution29"
}
layer {
  name: "inception4c_maxpool3x3"
  type: "Pooling"
  bottom: "Concat4"
  top: "Pooling5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception4c_maxpool3x3_proj1x1"
  type: "Convolution"
  bottom: "Pooling5"
  top: "Convolution30"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4c_maxpool3x3_proj1x1_relu"
  type: "ReLU"
  bottom: "Convolution30"
  top: "Convolution30"
}
layer {
  name: "inception4c_output"
  type: "Concat"
  bottom: "Convolution25"
  bottom: "Convolution27"
  bottom: "Convolution29"
  bottom: "Convolution30"
  top: "Concat5"
}
layer {
  name: "inception4d_conv1x1"
  type: "Convolution"
  bottom: "Concat5"
  top: "Convolution31"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 112
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4d_conv1x1_relu"
  type: "ReLU"
  bottom: "Convolution31"
  top: "Convolution31"
}
layer {
  name: "inception4d_conv3x3_reduce"
  type: "Convolution"
  bottom: "Concat5"
  top: "Convolution32"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 144
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4d_conv3x3_reduce_relu"
  type: "ReLU"
  bottom: "Convolution32"
  top: "Convolution32"
}
layer {
  name: "inception4d_"
  type: "Convolution"
  bottom: "Convolution32"
  top: "Convolution33"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 288
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4d_conv3x3"
  type: "ReLU"
  bottom: "Convolution33"
  top: "Convolution33"
}
layer {
  name: "inception4d_conv5x5_reduce"
  type: "Convolution"
  bottom: "Concat5"
  top: "Convolution34"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4d_conv5x5_reduce_relu"
  type: "ReLU"
  bottom: "Convolution34"
  top: "Convolution34"
}
layer {
  name: "inception4d_conv5x5"
  type: "Convolution"
  bottom: "Convolution34"
  top: "Convolution35"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4d_conv5x5_relu"
  type: "ReLU"
  bottom: "Convolution35"
  top: "Convolution35"
}
layer {
  name: "inception4d_maxpool3x3"
  type: "Pooling"
  bottom: "Concat5"
  top: "Pooling6"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception4d_maxpool3x3_proj1x1"
  type: "Convolution"
  bottom: "Pooling6"
  top: "Convolution36"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4d_maxpool3x3_proj1x1_relu"
  type: "ReLU"
  bottom: "Convolution36"
  top: "Convolution36"
}
layer {
  name: "inception4d_output"
  type: "Concat"
  bottom: "Convolution31"
  bottom: "Convolution33"
  bottom: "Convolution35"
  bottom: "Convolution36"
  top: "Concat6"
}
layer {
  name: "inception4e_conv1x1"
  type: "Convolution"
  bottom: "Concat6"
  top: "Convolution37"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4e_conv1x1_relu"
  type: "ReLU"
  bottom: "Convolution37"
  top: "Convolution37"
}
layer {
  name: "inception4e_conv3x3_reduce"
  type: "Convolution"
  bottom: "Concat6"
  top: "Convolution38"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4e_conv3x3_reduce_relu"
  type: "ReLU"
  bottom: "Convolution38"
  top: "Convolution38"
}
layer {
  name: "inception4e_"
  type: "Convolution"
  bottom: "Convolution38"
  top: "Convolution39"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 320
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4e_conv3x3"
  type: "ReLU"
  bottom: "Convolution39"
  top: "Convolution39"
}
layer {
  name: "inception4e_conv5x5_reduce"
  type: "Convolution"
  bottom: "Concat6"
  top: "Convolution40"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4e_conv5x5_reduce_relu"
  type: "ReLU"
  bottom: "Convolution40"
  top: "Convolution40"
}
layer {
  name: "inception4e_conv5x5"
  type: "Convolution"
  bottom: "Convolution40"
  top: "Convolution41"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4e_conv5x5_relu"
  type: "ReLU"
  bottom: "Convolution41"
  top: "Convolution41"
}
layer {
  name: "inception4e_maxpool3x3"
  type: "Pooling"
  bottom: "Concat6"
  top: "Pooling7"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception4e_maxpool3x3_proj1x1"
  type: "Convolution"
  bottom: "Pooling7"
  top: "Convolution42"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception4e_maxpool3x3_proj1x1_relu"
  type: "ReLU"
  bottom: "Convolution42"
  top: "Convolution42"
}
layer {
  name: "inception4e_output"
  type: "Concat"
  bottom: "Convolution37"
  bottom: "Convolution39"
  bottom: "Convolution41"
  bottom: "Convolution42"
  top: "Concat7"
}
layer {
  name: "inception4_maxpool"
  type: "Pooling"
  bottom: "Concat7"
  top: "inception4_maxpool"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "inception5a_conv1x1"
  type: "Convolution"
  bottom: "inception4_maxpool"
  top: "Convolution43"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception5a_conv1x1_relu"
  type: "ReLU"
  bottom: "Convolution43"
  top: "Convolution43"
}
layer {
  name: "inception5a_conv3x3_reduce"
  type: "Convolution"
  bottom: "inception4_maxpool"
  top: "Convolution44"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception5a_conv3x3_reduce_relu"
  type: "ReLU"
  bottom: "Convolution44"
  top: "Convolution44"
}
layer {
  name: "inception5a_"
  type: "Convolution"
  bottom: "Convolution44"
  top: "Convolution45"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 320
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception5a_conv3x3"
  type: "ReLU"
  bottom: "Convolution45"
  top: "Convolution45"
}
layer {
  name: "inception5a_conv5x5_reduce"
  type: "Convolution"
  bottom: "inception4_maxpool"
  top: "Convolution46"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception5a_conv5x5_reduce_relu"
  type: "ReLU"
  bottom: "Convolution46"
  top: "Convolution46"
}
layer {
  name: "inception5a_conv5x5"
  type: "Convolution"
  bottom: "Convolution46"
  top: "Convolution47"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception5a_conv5x5_relu"
  type: "ReLU"
  bottom: "Convolution47"
  top: "Convolution47"
}
layer {
  name: "inception5a_maxpool3x3"
  type: "Pooling"
  bottom: "inception4_maxpool"
  top: "Pooling8"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception5a_maxpool3x3_proj1x1"
  type: "Convolution"
  bottom: "Pooling8"
  top: "Convolution48"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception5a_maxpool3x3_proj1x1_relu"
  type: "ReLU"
  bottom: "Convolution48"
  top: "Convolution48"
}
layer {
  name: "inception5a_output"
  type: "Concat"
  bottom: "Convolution43"
  bottom: "Convolution45"
  bottom: "Convolution47"
  bottom: "Convolution48"
  top: "Concat8"
}
layer {
  name: "inception5b_conv1x1"
  type: "Convolution"
  bottom: "Concat8"
  top: "conv1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 384
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception5b_conv1x1_relu"
  type: "ReLU"
  bottom: "conv1x1"
  top: "conv1x1"
}
layer {
  name: "inception5b_conv3x3_reduce"
  type: "Convolution"
  bottom: "Concat8"
  top: "conv3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 192
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception5b_conv3x3_reduce_relu"
  type: "ReLU"
  bottom: "conv3x3_reduce"
  top: "conv3x3_reduce"
}
layer {
  name: "inception5b_"
  type: "Convolution"
  bottom: "conv3x3_reduce"
  top: "conv3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception5b_conv3x3"
  type: "ReLU"
  bottom: "conv3x3"
  top: "conv3x3"
}
layer {
  name: "inception5b_conv5x5_reduce"
  type: "Convolution"
  bottom: "Concat8"
  top: "conv5x5_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 48
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception5b_conv5x5_reduce_relu"
  type: "ReLU"
  bottom: "conv5x5_reduce"
  top: "conv5x5_reduce"
}
layer {
  name: "inception5b_conv5x5"
  type: "Convolution"
  bottom: "conv5x5_reduce"
  top: "conv5x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception5b_conv5x5_relu"
  type: "ReLU"
  bottom: "conv5x5"
  top: "conv5x5"
}
layer {
  name: "inception5b_maxpool3x3"
  type: "Pooling"
  bottom: "Concat8"
  top: "maxpool3x3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception5b_maxpool3x3_proj1x1"
  type: "Convolution"
  bottom: "maxpool3x3"
  top: "maxpool3x3_proj1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception5b_maxpool3x3_proj1x1_relu"
  type: "ReLU"
  bottom: "maxpool3x3_proj1x1"
  top: "maxpool3x3_proj1x1"
}
layer {
  name: "inception5b_output"
  type: "Concat"
  bottom: "conv1x1"
  bottom: "conv3x3"
  bottom: "conv5x5"
  bottom: "maxpool3x3_proj1x1"
  top: "inception_output"
}
layer {
  name: "loss1_avgpool5x5_3v"
  type: "Pooling"
  bottom: "Concat3"
  top: "loss1_avgpool5x5_3v"
  pooling_param {
    pool: AVE
    kernel_size: 5
    stride: 3
  }
}
layer {
  name: "loss1_conv1x1_1s"
  type: "Convolution"
  bottom: "loss1_avgpool5x5_3v"
  top: "loss1_conv1x1_1s"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298023224
    }
  }
}
layer {
  name: "loss1_conv1x1_1s_relu"
  type: "ReLU"
  bottom: "loss1_conv1x1_1s"
  top: "loss1_conv1x1_1s"
}
layer {
  name: "loss1_fc1"
  type: "InnerProduct"
  bottom: "loss1_conv1x1_1s"
  top: "loss1_fc1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "loss1_fc1_relu1"
  type: "ReLU"
  bottom: "loss1_fc1"
  top: "loss1_fc1"
}
layer {
  name: "loss1_dropout"
  type: "Dropout"
  bottom: "loss1_fc1"
  top: "loss1_fc1"
  dropout_param {
    dropout_ratio: 0.699999988079071
  }
}
layer {
  name: "loss1_pred_fc"
  type: "InnerProduct"
  bottom: "loss1_fc1"
  top: "loss1_pred_fc"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "loss1"
  type: "SoftmaxWithLoss"
  bottom: "loss1_pred_fc"
  bottom: "label"
  top: "loss1"
  loss_weight: 0.30000001192092896
}
layer {
  name: "loss2_avgpool5x5_3v"
  type: "Pooling"
  bottom: "Concat6"
  top: "loss2_avgpool5x5_3v"
  pooling_param {
    pool: AVE
    kernel_size: 5
    stride: 3
  }
}
layer {
  name: "loss2_conv1x1_1s"
  type: "Convolution"
  bottom: "loss2_avgpool5x5_3v"
  top: "loss2_conv1x1_1s"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298023224
    }
  }
}
layer {
  name: "loss2_conv1x1_1s_relu"
  type: "ReLU"
  bottom: "loss2_conv1x1_1s"
  top: "loss2_conv1x1_1s"
}
layer {
  name: "loss2_fc1"
  type: "InnerProduct"
  bottom: "loss2_conv1x1_1s"
  top: "loss2_fc1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "loss2_fc1_relu1"
  type: "ReLU"
  bottom: "loss2_fc1"
  top: "loss2_fc1"
}
layer {
  name: "loss2_dropout"
  type: "Dropout"
  bottom: "loss2_fc1"
  top: "loss2_fc1"
  dropout_param {
    dropout_ratio: 0.699999988079071
  }
}
layer {
  name: "loss2_pred_fc"
  type: "InnerProduct"
  bottom: "loss2_fc1"
  top: "loss2_pred_fc"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "loss2"
  type: "SoftmaxWithLoss"
  bottom: "loss2_pred_fc"
  bottom: "label"
  top: "loss2"
  loss_weight: 0.30000001192092896
}
layer {
  name: "avgpool7x7_s1"
  type: "Pooling"
  bottom: "inception_output"
  top: "avgpool7x7_s1"
  pooling_param {
    pool: AVE
    kernel_size: 4
    stride: 1
  }
}
layer {
  name: "avgpool7x7_s1_dropout"
  type: "Dropout"
  bottom: "avgpool7x7_s1"
  top: "avgpool7x7_s1"
  dropout_param {
    dropout_ratio: 0.4000000059604645
  }
}
layer {
  name: "loss_pred_fc"
  type: "InnerProduct"
  bottom: "avgpool7x7_s1"
  top: "loss_pred_fc"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "loss_pred_fc"
  bottom: "label"
  top: "loss"
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "loss_pred_fc"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
